FemDesign.Results.CsvParser
CSV reader. Reads a comma (or other char) delimited file, line by line and parses each line to a new object. Header lines can be handled with the HeaderParser.

FemDesign.Results.CsvParser.HeaderParser
Returns a boolean representing wether the current line is a Header.

FemDesign.Results.CsvParser.RowParser
Parses a split line to a new object. Applied on every line not a header.

FemDesign.Results.CsvParser.Header
Last header row read by the header parser.

FemDesign.Results.CsvParser.PeekLine
Returns the next line to be read without consuming it, thus it will still be read by ReadLine.
Returns:

FemDesign.Results.CsvParser.PeekNextLine
Returns the next line that has not already been peeked. The line will not be consumed but still will be read by ReadLine.
Returns:

FemDesign.Results.CsvParser.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources